In [144]:
#Import Dependencies
import pandas as pd
from pathlib import Path

In [145]:
# Store filepaths into variables
total_asset_loan_value_csv = Path("Resources/Total Loan Assets.csv")
average_rate_of_financed_loan_csv = Path("Resources/Average Loan Finance.csv")
average_amount_financed_csv= Path("Resources/Average Amount Financed.csv")

In [146]:
# Read the CSV files
total_asset_loan_value_df = pd.read_csv(total_asset_loan_value_csv)
average_rate_of_financed_loan_df = pd.read_csv(average_rate_of_financed_loan_csv)
average_amount_financed_df = pd.read_csv(average_amount_financed_csv)

In [147]:
#Dispay the data
total_asset_loan_value_df.head()

         DATE  QBPBSTASLNINDVOLNINDCARLN
0  2014-07-01                 379531.304
1  2014-10-01                 385156.262
2  2015-01-01                 389633.848
3  2015-04-01                 397633.220
4  2015-07-01                 407873.676

In [148]:
#Rename Columns & Change to Float
total_asset_loan_value_df = total_asset_loan_value_df.rename(columns={"QBPBSTASLNINDVOLNINDCARLN": "Total Loan Amount"})
total_asset_loan_value_df.head()

         DATE  Total Loan Amount
0  2014-07-01         379531.304
1  2014-10-01         385156.262
2  2015-01-01         389633.848
3  2015-04-01         397633.220
4  2015-07-01         407873.676

In [157]:
total_asset_loan_value_df["Total Loan Amount Millions"] = total_asset_loan_value_df["Total Loan Amount"] * 1000000
total_asset_loan_value_df.head()

         DATE  Total Loan Amount  Total Loan Amount Millions
0  2014-07-01         379531.304                3.795313e+11
1  2014-10-01         385156.262                3.851563e+11
2  2015-01-01         389633.848                3.896338e+11
3  2015-04-01         397633.220                3.976332e+11
4  2015-07-01         407873.676                4.078737e+11

In [ ]:
average_rate_of_financed_loan_df.head()

         DATE  RIELPCFANNM
0  2014-07-01         4.68
1  2014-10-01         4.82
2  2015-01-01         5.19
3  2015-04-01         5.38
4  2015-07-01         4.92

In [158]:
#Rename Columns
average_rate_of_financed_loan_df = average_rate_of_financed_loan_df.rename(columns={"RIELPCFANNM": "Average Loan Rate"})
average_rate_of_financed_loan_df['Average Loan Rate'] = pd.to_numeric(average_rate_of_financed_loan_df['Average Loan Rate'], errors='coerce').fillna(0.0)
average_rate_of_financed_loan_df.head()

         DATE  Average Loan Rate
0  2014-07-01               4.68
1  2014-10-01               4.82
2  2015-01-01               5.19
3  2015-04-01               5.38
4  2015-07-01               4.92

In [160]:
average_rate_of_financed_loan_df["Average Loan Rate %"] = average_rate_of_financed_loan_df["Average Loan Rate"] / 100
average_rate_of_financed_loan_df.head()

         DATE  Average Loan Rate  Average Loan Rate %
0  2014-07-01               4.68               0.0468
1  2014-10-01               4.82               0.0482
2  2015-01-01               5.19               0.0519
3  2015-04-01               5.38               0.0538
4  2015-07-01               4.92               0.0492

In [151]:
average_amount_financed_df.head()

         DATE  DTCTLVENANM
0  2014-07-01     26370.63
1  2014-10-01     26755.30
2  2015-01-01     27272.36
3  2015-04-01     26932.27
4  2015-07-01     27697.60

In [152]:
average_amount_financed_df=average_amount_financed_df.rename(columns={"DTCTLVENANM": "Average Financed Amount"})
average_amount_financed_df['Average Financed Amount'] = pd.to_numeric(average_amount_financed_df['Average Financed Amount'], errors='coerce').fillna(0.0)
average_amount_financed_df.dtypes

DATE                        object
Average Financed Amount    float64
dtype: object

In [153]:
#Merge the dataframes
revenue_rate_df = pd.merge(total_asset_loan_value_df, average_rate_of_financed_loan_df, on="DATE")
revenue_rate_df.dtypes

DATE                  object
Total Loan Amount    float64
Average Loan Rate    float64
dtype: object

In [154]:
#Merge the dataframes
clean_df = pd.merge(revenue_rate_df, average_amount_financed_df, on="DATE")
clean_df.head()

         DATE  Total Loan Amount  Average Loan Rate  Average Financed Amount
0  2014-07-01         379531.304               4.68                 26370.63
1  2014-10-01         385156.262               4.82                 26755.30
2  2015-01-01         389633.848               5.19                 27272.36
3  2015-04-01         397633.220               5.38                 26932.27
4  2015-07-01         407873.676               4.92                 27697.60

In [155]:
#Calculate average amount financed by and multiply by the average rate of that period = give us new total of revenue generated during that month
clean_df.dtypes

DATE                        object
Total Loan Amount          float64
Average Loan Rate          float64
Average Financed Amount    float64
dtype: object

In [156]:
clean_df["Revenue Generated"] = clean_df["Average Financed Amount"] * clean_df["Average Loan Rate"]




clean_df.head()

,DATE,Total Loan Amount,Average Loan Rate,Average Financed Amount,Revenue Generated
0,2014-07-01,379531.304,4.68,26370.63,123414.5484
1,2014-10-01,385156.262,4.82,26755.30,128960.5460
2,2015-01-01,389633.848,5.19,27272.36,141543.5484
3,2015-04-01,397633.220,5.38,26932.27,144895.6126
4,2015-07-01,407873.676,4.92,27697.60,136272.1920